{"data":{"markdownRemark":{"html":"<p>The <a href=\"http://www.orchardproject.net/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Orchard CMS</a> version 0.8 has been released. This release has a new theme engine written using the new Razor rendering views. Orchard is based on ASP.NET MVC. Here is the write up from announcement on the release;</p>\n<p>The Orchard Project team is pleased to announce the availability of the Orchard 0.8 release, which provides essential features that designers need to tailor the look-and-feel of Orchard sites. The release can be downloaded from <a href=\"http://www.orchardproject.net/download\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">http://www.orchardproject.net/download</a> The Orchard 0.8 release includes a theme engine based on the new Razor syntax in ASP.NET MVC, which is an extensible object model for defining “shapes”, as well as a flexible template system for rendering those shapes. The theme engine includes support for multiple layouts and zones, a script and style sheet registration API, and more. It also includes a new default theme, “The Theme Machine”, which leverages these features and can be adapted to fit the needs of different site designs.  </p>\n<p>As if a Theme Machine isn’t cool enough, the 0.8 release also includes support for widgets - in this case, configurable UI elements, such as a tag cloud or search input, which can be easily mapped to different regions in the site (for example, a sidebar). The configuration of individual widgets and the rules about where they appear in the site are configurable from the Orchard admin panel.  </p>\n<p>For designers, this offers the flexibility to either brand individual sites or create reusable themes to be shared with others. Orchard 0.8 also includes support for packaging themes and publishing them to an online gallery feed where other users can discover and download them.</p>\n<p>I will be giving a presentation on Orchard at the <a href=\"http://www.jaxdug.com/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">JaxDUG</a> next Wednesday.</p>","frontmatter":{"title":"Orchard 0.8 Released","date":"17.01.2011","category":"Blog"},"timeToRead":1}},"pageContext":{"slug":"/orchard-0-8-released","prev":{"fields":{"slug":"/orchard-cms-presentation-tomorrow-at-jaxdug"},"frontmatter":{"title":"Orchard CMS Presentation tomorrow at JAXDUG","category":"Blog"}},"next":{"fields":{"slug":"/orchard-cms-presentation-in-november-at-jaxdug"},"frontmatter":{"title":"Orchard CMS Presentation in November at JAXDUG","category":"Blog"}}}}