{"data":{"markdownRemark":{"html":"<p>Yahoo's board of directors rejected Microsoft's offer to buy Yahoo this weekend. I have been thinking about the Microsoft Yahoo takeover proposition. It reminds me of Time Warner AOL merger. There are a lot of reasons why the AOL Time Warner merger failed. The one reason that sticks in mind was the cultural differences between AOL and Time Warner. The cultures of the two companies clashed. Never mind the fact that AOL's business model was based on dialup internet access and a walled garden of content.</p>\n<p>Microsoft and Yahoo would have similar culture problems if they merged. Microsoft eats its own dog food when it comes to consuming technology. Microsoft, for the most part, uses Windows Server, SQL Server, .NET and IIS. Yahoo uses a lot of open source technology including Apache, Linux and PHP. They also use a lot of Adobe software as well. The developers who develop for open source technologies, don't like Microsoft, and they do not want to work with Microsoft.</p>\n<p>If Microsoft were to buy Yahoo, they would not keep any of Yahoo's infrastructure. They would rip it out in favor of Microsoft technology. All of Yahoo's PHP apps would be rewritten in .NET, Linux would be replaced with Windows, and Apache would be replaced with IIS.</p>\n<p>Microsoft's attraction to Yahoo has to largely with Ad revenue. Ironically, this is one of the things that attracted Time Warner to AOL.</p>\n<p>For full disclosure, my current employer is a Gold Partner with Microsoft. I am also a stockholder in a company that does business with Yahoo. At my current company, we have a pretty good working relationship with Microsoft. I think Microsoft should consider partnering in certain areas with Yahoo, but a full merger is a bad idea.</p>","frontmatter":{"title":"Microsoft Yahoo Hostile Takeover","date":"17.01.2011","category":"Blog"},"timeToRead":1}},"pageContext":{"slug":"/microsoft-yahoo-hostile-takeover","prev":{"fields":{"slug":"/microsoft-now-have-their-own-version-of-eclipse"},"frontmatter":{"title":"Microsoft now have their own version of Eclipse","category":"Blog"}},"next":{"fields":{"slug":"/microsoft-shipping-j-query-with-visual-studio"},"frontmatter":{"title":"Microsoft Shipping jQuery with Visual Studio","category":"Blog"}}}}