{"data":{"markdownRemark":{"html":"<p>Thanks to James Ahrens for sending this to me;</p>\n<p>You Might Be a Redneck Pilot If: </p>\n<p>1. Your stall warning plays DIXIE. </p>\n<p>2. Your cross-country flight plan uses flea markets as checkpoints. </p>\n<p>3. You think sectionals should show trailer parks. </p>\n<p>4. You've ever used moonshine as AV-Gas. </p>\n<p>5. Your 172's wheel pants have mud flaps with a chrome silhouette of a reclining</p>\n<p>nude. </p>\n<p>6. Your toothpick keeps poking your mike. </p>\n<p>7. You've ever taxied around the airport just drinking beer. </p>\n<p>8. You wouldn't be caught dead in a Grumman Yankee. </p>\n<p>9. You use an old sweet mix sack as a windsock. </p>\n<p>10. You constantly confuse \"Beechcraft\" with \"Beechnut.\" </p>\n<p>11. You've never flown a nose-wheel airplane. </p>\n<p>12. You refer to formation flying as \"We got us a convoy.\" </p>\n<p>13. Your matched set of lightweight flying luggage is three grocery bags from Piggly</p>\n<p>Wiggly. </p>\n<p>14. You have a gun rack in the rear window. </p>\n<p>15. You have more than one roll of duct tape holding your cowling on. </p>\n<p>16. You figure mud and manure in your weight and balance calculations. </p>\n<p>17. You siphon gas from your tractor to go flying. </p>\n<p>18. You've never landed at an actual airport even though you've been flying</p>\n<p>for over 20 years. </p>\n<p>19. You've ever ground looped to avoid hitting a cow. </p>\n<p>20. You consider anything over 500-ft AGL as High Altitude Flying. </p>\n<p>21. There are parts on your aircraft labeled \"John Deere.\" </p>\n<p>22. You don't own a current sectional, but have all the Texaco road maps for</p>\n<p>your area. </p>\n<p>23. There's a brown streak down each side of your airplane; exhaust on the </p>\n<p>right side and tobacco on the left. </p>\n<p>24. You have to buzz the strip to chase off the livestock before landing. </p>\n<p>25. You use an old parachute for a portable hanger. </p>\n<p>26. You've ever landed on Main Street for a cup of coffee. </p>\n<p>27. The tread pattern, if any, on all three of your tires is different. </p>\n<p>28. You have a pair of fuzzy dice and some small copper shoes hanging from the </p>\n<p>Magnetic Compass. </p>\n<p>29. You put straw in the baggage compartment so your dogs don't get cold. </p>\n<p>30. You've got matching bumper stickers on each side of the vertical stabilizer.</p>\n<p>31. There are grass stains on the tips of your propeller. </p>\n<p>32. Somewhere on your plane, there's a bumper sticker that reads \"I'd</p>\n<p>rather be fishing.\" </p>\n<p>33. You navigate with your ADF tuned to only AM country stations. </p>\n<p>34. You think an ultra light is a new sissy beer from Budweiser. </p>\n<p>35. Just before the crash, everybody on the UNICOM heard you say, \"Hey Y'all-Watch</p>\n<p>This!\" </p>\n<p>36. You use your airplane for camping.</p>","frontmatter":{"title":"HowYou might be a Red Neck Pilot if","date":"17.01.2011","category":"Blog"},"timeToRead":2}},"pageContext":{"slug":"/how-you-might-be-a-red-neck-pilot-if","prev":{"fields":{"slug":"/flex-2-presentation-at-jax-fusion-august-1st-meeting"},"frontmatter":{"title":"Flex 2 presentation at JaxFusion August 1st meeting","category":"Blog"}},"next":{"fields":{"slug":"/how-to-set-up-sharepoint-my-site-sites"},"frontmatter":{"title":"How to set up Sharepoint My Site sites","category":"Blog"}}}}