{"data":{"markdownRemark":{"html":"<p><img src=\"http://www.fekke.com/blog/images//jeff-woods-drum-remembered.jpg\"></p>\n<p>I just learned today from a friend of mine that a Tampa based Drummer Jeff Wood passed away. I had the pleasure of knowing Jeff when he was the drummer in Barely Pink. Jeff was diagnosed with brain cancer and been fighting it for many years.</p>\n<p>Jeff was in a lot of different bands in the Tampa Bay area. On top of being an amazing drummer, Jeff was also a great vocalist.</p>\n<p>Here is note I got from Mark Warren this morning;</p>\n<p>[code:c#]</p>\n<p>The Tampa Bay music scene lost one of its own and it hurts bad. Following a long struggle with brain cancer, Jeff Wood passed away yesterday. Beloved by all who knew him, Jeff was a constant on the scene for more than 20 years, playing drums with an intensity and passion you'd rarely see even amongst his drumming heroes. The guy was the real deal, a good friend to have and any band privileged to count him as a member was better for it. And he played with a lot of them over the years -- odds are, if you've been a musician for any length of time in Tampa Bay, either you've been in a band with Jeff or you know someone who has. The Vodkanauts are no exception -- guitarist Mark Warren played with Jeff while a member of power-poppers Barely Pink and V'nauts drummer Stan Arthur was Jeff's successor in Barely Pink. Notice the avoidance of the word \"replacement\" as Jeff Wood is, was and always will be irreplaceable, truly a one-of-a-kind both as a musician and a human being. Our thoughts go out to Jeff's incredible family, girlfriend Vicki and everyone who's feeling this loss as deeply as we are. It's not gonna be easy but we will get through this.</p>\n<p>Whenever tragedies like this occur, it serves as a reminder of just how brief our stay on the big blue marble can be and how abruptly it can come to a halt. With that in mind, we urge you to tell your loved ones just how much you care about them on a regular and frequent basis. If there's amends to make, do it now. And if you've got dreams, don't hesitate another moment to realize them.</p>\n<p>Peace.</p>\n<p>[/code]></p>\n<p>Update;</p>\n<p>Here is a list of bands that Jeff played in as drummer;</p>\n<ul>\n<li>\n<p>The Moon Calves</p>\n</li>\n<li>\n<p>Fugitive Kind</p>\n</li>\n<li>\n<p>Forgotten Apostles</p>\n</li>\n<li>\n<p>Monday Mornings</p>\n</li>\n<li>\n<p>Smashmouth</p>\n</li>\n<li>\n<p>Joe Popp</p>\n</li>\n<li>\n<p>Barely Pink</p>\n</li>\n<li>\n<p>Spiller</p>\n</li>\n<li>\n<p>Nutrajet</p>\n</li>\n<li>\n<p>and many, many more.</p>\n</li>\n</ul>\n<p>There was a mention of this yesterday on the <a href=\"http://seminoleheights.blogspot.com/2007/09/heights-loses-one-of-our-own.html\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Seminole Heights Blog</a></p>","frontmatter":{"title":"Drummer Jeff Wood Passes Away","date":"17.01.2011","category":"Blog"},"timeToRead":2}},"pageContext":{"slug":"/drummer-jeff-wood-passes-away","prev":{"fields":{"slug":"/duck-typing-is-not-about-performance"},"frontmatter":{"title":"Duck typing is not about performance","category":"Blog"}},"next":{"fields":{"slug":"/studio-8"},"frontmatter":{"title":"Studio 8","category":"Blog"}}}}