{"data":{"markdownRemark":{"html":"<p>SouthWest Signal has been trying to place a ColdFusion developer at their offices in Jacksonville, Fl.</p>\n<p>Here is the job description; [code:c#]</p>\n<p>Southwest Signal Engineering is expanding and we are looking for aColdFusion Web Developer for our Jacksonville, Florida office. Theindividual will work with a team &#x26; independently on web developmentand function in multiple roles to include: business analyst, developerand tester. They will design and develop new forms, reports and otherweb applications, support modification requests, identify and solveissues within several web applications.</p>\n<p>Specific experience/knowledge requirements include:</p>\n<p>A minimum of three years of web-based software development &#x26; hands-on experience on ColdFusion web development efforts.</p>\n<p>Experience developing object-oriented ColdFusion web-basedapplications using CFCs and standard frameworks (e.g., Mach-ii,ModelGlue).</p>\n<p>Familiarity with all areas of software developmentincluding object-oriented software design and how to transform modelsinto software code; user interface/front-end development (HTML, CSS);and business object/component development.</p>\n<p>Database programming experience using SQL: hands-onexperience with Microsoft SQLServer and/or MySQL plus experience withdatabase design and modeling preferred.</p>\n<p>Broad software-development experience preferred. BeyondColdFusion, Additional experience in other developmentenvironments/languages such as PHP/Python/Ruby/.Net also preferred..</p>\n<p>Recognition and observance of industry-standardarchitectural and coding standards, an understanding of best-practicesin software development, and familiarity with different SDLC processesand agile methodologies. </p>\n<p>The ideal candidate will have good verbal and written communication skills</p>\n<p>Bachelors degree in Computer Science or closely related area, or equivalent experience preferred.</p>\n<p>[/code]></p>\n<p>Contact <a href=\"mailto:a_daveline@swsignal.com?subject=ColdFusion%20Developer\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">a_daveline@swsignal.com</a></p>","frontmatter":{"title":"SouthWest Signal Needs ColdFusion Developer","date":"17.01.2011","category":"Blog"},"timeToRead":1}},"pageContext":{"slug":"/south-west-signal-needs-cold-fusion-developer","prev":{"fields":{"slug":"/speculation-about-the-death-of-j-run"},"frontmatter":{"title":"Speculation About The Death of JRun","category":"Blog"}},"next":{"fields":{"slug":"/blue-ray-vs-hddvd-why-sony-will-lose"},"frontmatter":{"title":"Blue Ray vs. HDDVD: Why Sony will lose","category":"Blog"}}}}