{"data":{"markdownRemark":{"html":"<p>Vurv Technology, my employer, needs to hire another ColdFusion developer. Here is the job posting below;</p>\n<p><a href=\"http://corporate.recruitmax.com/main/careerportal/job_profile.cfm?szOrderID=227437\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Cold Fusion Developer - Senior</a></p>\n<p>Vurv Technologies Inc. is an award-winning global provider of workforce management solutions. We provide software and services that allow companies to attract, hire, retain, and manage their workforces more efficiently. Headquartered in Jacksonville, Florida, Vurv provides solutions that are used by more than 40,000 users at over 500 client companies, ranging from small recruiting firms to multinational Fortune 100 companies.  </p>\n<p>The preferred candidate will be a self-starter who works well in a team environment. He/She should possess the discipline and stress management of meeting challenging deadlines. Strong communication skills are a must as client and internal interaction is an essential component of the position. The candidate must possess the ability and experience to jump in and make a difference immediately.  </p>\n<p>Responsibilities:  </p>\n<ul>\n<li>\n<p>Maintain, design, and develop enterprise components and database architecture used for data integration, data conversion, localization, and reporting.  </p>\n</li>\n<li>\n<p>Implement new technologies that will increase software and middleware efficiencies.  </p>\n</li>\n<li>\n<p>Code / Develop / Architect new and existing products and enhancements.  </p>\n</li>\n<li>\n<p>Maintain and upgrade existing installed products.  </p>\n</li>\n<li>\n<p>Debug and test all work.  </p>\n</li>\n</ul>\n<p>Strong Development Qualifications Include:  </p>\n<ul>\n<li>Cold Fusion, ColdFusion, CFML  </li>\n</ul>\n<p>Preferred Skills:  </p>\n<ul>\n<li>\n<p>ColdFusion MX  </p>\n</li>\n<li>\n<p>HR-XML  </p>\n</li>\n<li>\n<p>SQL Statements, T-SQL, DTS  </p>\n</li>\n<li>\n<p>Stored procedures, triggers, arrays, regular expressions  </p>\n</li>\n<li>\n<p>JavaScript, Java Script  </p>\n</li>\n<li>\n<p>SQL Server  </p>\n</li>\n<li>\n<p>Oracle  </p>\n</li>\n<li>\n<p>Globalization, Translation, Localization, Internationalization  </p>\n</li>\n<li>\n<p>Ability to travel up to 10%  </p>\n</li>\n<li>\n<p>Must have outstanding customer service skills, both written and verbal  </p>\n</li>\n<li>\n<p>Excellent attention to detail and organizational skills required  </p>\n</li>\n<li>\n<p>Ability to work in a team environment  </p>\n</li>\n</ul>\n<p>Vurv hires only top talent, and offers excellent benefits and has a fun, casual work environment, but employees must be able to work in a fast-paced, production atmosphere. Good communication skills and teamwork required.</p>","frontmatter":{"title":"ColdFusion position in Jacksonville","date":"17.01.2011","category":"Blog"},"timeToRead":2}},"pageContext":{"slug":"/cold-fusion-position-in-jacksonville","prev":{"fields":{"slug":"/cold-fusion-positions-in-palm-coast-fl"},"frontmatter":{"title":"ColdFusion positions in Palm Coast, Fl","category":"Blog"}},"next":{"fields":{"slug":"/cold-fusion-product-manager-jason-delmore-cut-from-adobe"},"frontmatter":{"title":"ColdFusion Product Manager Jason Delmore Cut from Adobe","category":"Blog"}}}}