{"data":{"markdownRemark":{"html":"<p>I wanted to put a reminder out that the next <a href=\"jaxmug.com\" title=\"JaxMUG\">JaxMUG</a> meeting will be this Tuesday, October 30th at <a href=\"http://maps.google.com/maps?q=5+W.+Forsyth+St.+Jacksonville,+FL+32202\" title=\"Map to CoWorkJax\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">CoWorkJax</a>. The meeting will start at 6:00 PM. </p>\n<p>Here is the write up on the presentation;</p>\n<p><span style=\"color: #4e443c; font-family: 'Open Sans', 'Helvetica Neue', Helvetica, Arial, sans-serif; font-size: 14px; line-height: 18px; background-color: #faf9f2;\">A brief overview of some of the new features available to developers in iOS 6, including Passbook, Transit routing and the new Maps API, and Facebook sharing. Also, some perspective on being a member of the community of iOS and Mac developers, including WWDC experiences from the last few years. Bring any questions you may have!</span></p>\n<p><span style=\"color: #4e443c; font-family: 'Open Sans', 'Helvetica Neue', Helvetica, Arial, sans-serif; font-size: 14px; line-height: 18px; background-color: #faf9f2;\">Mike Glass is the President of Pocket Sevens, Inc., a Jacksonville based mobile development consultancy focused on iPhone and iPad apps. He has been developing for Mac OS since 2006, and iOS since day one of the iPhone SDK in 2008. His passion is building awesome, creative and easy to use apps. He also speaks on simplicity and usability in the iOS development world. Outside of work, he loves cooking, airplanes, boats and the New York Yankees. He is originally from Connecticut, and now lives in Jacksonville with his wife Nicole and daughter Madison.</span></p>","frontmatter":{"title":"New Features in iOS 6 at the next JaxMUG on Tuesday","date":"24.10.2012","category":"Blog"},"timeToRead":1}},"pageContext":{"slug":"/new-features-in-i-os-6-at-the-next-jax-mug-on-tuesday","prev":{"fields":{"slug":"/presentation-on-new-i-os-6-features-for-developers-tomorrow-at-co-work-jax"},"frontmatter":{"title":"Presentation on new iOS 6 features for developers tomorrow at CoWorkJax","category":"Blog"}},"next":{"fields":{"slug":"/slides-from-this-years-jax-code-camp"},"frontmatter":{"title":"Slides from this years JaxCodeCamp","category":"Blog"}}}}