{"data":{"markdownRemark":{"html":"<p>I received the following message from Brian LeGros;</p>\n<p>Hello everyone,</p>\n<p>The Adobe Developers of Greater Orlando (Adogo) user group has been selected as a stop on Adobe's Flex 3 Pre-release Tour. We're fortunate enough to have Ben Forta, Adobe's Senior Technical Evangelist, speaking to the group for this leg of the tour. The meeting will be held on January 21st, 2008 @ 7:00 PM in the Oleander Room at Westgate Lakes Resort and Spa (located at 10000 Turkey Lake Road, Orlando , FL 32819, parking at The Smokehouse). We'll be giving away a copy of Flex 3 and CS3 Web Premium, a pass to CFUnited 2008, as well as lots of branded schwag from Adobe and CFUnited. Food and drink will be provided to all in attendance while it lasts. Registration for this event is available at <a href=\"http://adogo200801.eventbrite.com/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">http://adogo200801.eventbrite.com/</a>. Additionally, more information can also be found on our website at <a href=\"http://adogo.us\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">http://adogo.us</a>.</p>\n<p>Since this will be the only stop on the tour in the state, we would like to extend an invitation to all of the Adobe User Groups in Florida to join us for our meeting. We are attempting to promote this event as much as possible, but our channels outside of the Orlando area are somewhat limited. If anyone is open to helping, we are definitely grateful for any cross promotions you and your groups can provide for this event.</p>\n<p>I apologize if this email has reached you in error; I took these emails addresses from your user group's websites as well as the contact information from Adobe. If there are any questions we can answer for you, please don't hesitate to contact myself, Adam, or Max (see CC). Thanks for your time and we hope to see you all at the meeting.</p>\n<p>-Brian LeGros</p>","frontmatter":{"title":"Ben Forta coming to speak in Orlando on January 21st","date":"17.01.2011","category":"Blog"},"timeToRead":1}},"pageContext":{"slug":"/ben-forta-coming-to-speak-in-orlando-on-january-21st","prev":{"fields":{"slug":"/ben-forta-responds-to-the-computerworlds-shoddy-journalism"},"frontmatter":{"title":"Ben Forta responds to the Computerworld's shoddy journalism","category":"Blog"}},"next":{"fields":{"slug":"/ben-forta-asking-for-cold-fusion-8-beta-testers"},"frontmatter":{"title":"Ben Forta asking for ColdFusion 8 beta testers","category":"Blog"}}}}