{"data":{"markdownRemark":{"html":"<p>I moved my site over to <a href=\"http://www.orchardproject.net\" title=\"Orchard\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Orchard</a> 1.0 today. If you are not familiar with Orchard, it is a new open source content management system based on ASP.NET MVC 3.0.</p>\n<p>I used Nick Mayne's BlogML importer to bring over my old blog. I will have a post up soon on the <span class=\"spell noline\">challenges</span> I had with my conversion.</p>\n<p>Here is the writeup on The Orchard web site about their mission;</p>\n<p>Orchard is a <strong>free, open source, community-focused</strong> project aimed at delivering applications and reusable components on the ASP.NET platform.</p>\n<p>Orchard will create shared components for building ASP.NET applications and extensions, and specific applications that leverage these components to meet the needs of end-users, designers, developers, and Web professionals. Additionally, we seek to create partnerships with existing application authors to help them achieve their goals. Orchard is delivered as part of the <a href=\"http://www.outercurve.org/Galleries/ASPNETOpenSourceGallery.aspx\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">ASP.NET Open Source Gallery</a> under the <a href=\"http://www.outercurve.org/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Outercurve Foundation</a>. It is licensed under a <a href=\"http://www.opensource.org/licenses/bsd-license.php\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">New BSD license</a>, which is approved by the OSI.</p>\n<p>The intended output of the Orchard project is three-fold:</p>\n<ul>\n<li>Individual .NET-based applications that appeal to end-users, designers, developers, and Web professionals</li>\n<li>A set of re-usable components that makes it easy to build such applications</li>\n<li>A vibrant community to help define these applications and extensions</li>\n</ul>\n<p>In the near term, the Orchard project is focused on delivering a .NET-based CMS application that will allow users to rapidly create content-driven Websites, and an extensibility framework that will allow developers and customizers to provide additional functionality through module extensions and themes.</p>","frontmatter":{"title":"Fekke.com is now hosted on Orchard 1.0","date":"19.01.2011","category":"Blog"},"timeToRead":1}},"pageContext":{"slug":"/fekke-com-is-now-hosted-on-orchard-1-0","prev":{"fields":{"slug":"/j-query-1-5-released"},"frontmatter":{"title":"JQuery 1.5 Released","category":"Blog"}},"next":{"fields":{"slug":"/wunder-weather-widget"},"frontmatter":{"title":"Wunder Weather Widget","category":"Blog"}}}}