{"data":{"markdownRemark":{"html":"<p>My current employer, Idea Integration, is looking for candidates with</p>\n<p>Microsoft SQL Server Integration Services (SSIS) ETL and Database Developer experience. Here is a description below; <strong>Job Description</strong></p>\n<p>Under minimal supervision, the ETL developer will be responsible for interpreting and creating mapping documentation and translating it into detailed design specifications and ETL code via SQL Server Integration Services (formerly known as DTS). This person will be responsible for all ETL aspects of data warehousing/data mart applications, and data quality. They will be responsible for a mix of new development, production support, and managing data quality. In support of ETL development they will analyze, develop, test, and implement database as well as perform data modeling and logical and physical database design. They also will assist customers in researching data issues and problem solving.</p>\n<p><strong>Essential Functions</strong></p>\n<p>Design, develop, code, test and maintain SQL Server Integration Services (SSIS) packages that perform Extract Transform &#x26; Load (ETL) processes. Design and code the ETL logic to enable initial load and incremental processing, error and exception handling, restartability and recovery, data cleansing, validation and monitoring. Create documentation of ETL process flows, ETL technical designs, and specifications. Create, expand, and optimize ETL jobs based on ETL specifications driven by changing business requirements. Write database procedures, functions and views to optimize ETL processes. Coordinate source data feeds to ETL targets. Develop, document, and execute test plans. Plan and implementing data integration processes for multiple source systems. Identify and resolve problems encountered during both development and release of ETL systems. Analyze and implement enhancements to ETL and database systems. </p>\n<p><strong>Desired Skills</strong></p>\n<p>Extensive experience with Microsoft Data Transformation Services (DTS - SQL Server 2000) and/or experience with SQL Server Integration Services (SSIS - SQL Server 2005) are required. Minimum 3 plus years of SQL Server development skills including creation of tables, views, stored procedures, and user defined functions is required. Experience documenting ETL requirements and designs required. Must have experience tuning and optimizing queries. Candidates must have excellent interpersonal and communication skills, professional appearance, and a stable work history. Previous experience working as a consultant preferred. Experience with data warehousing preferred.</p>\n<p>Please contact joe dot salvatore at idea dot com.</p>","frontmatter":{"title":"Idea Integration looking for SQL developers with SSIS experience","date":"17.01.2011","category":"Blog"},"timeToRead":1}},"pageContext":{"slug":"/idea-integration-looking-for-sql-developers-with-ssis-experience","prev":{"fields":{"slug":"/running-cfmx-7-on-the-fedora-core"},"frontmatter":{"title":"Running CFMX 7 on the Fedora core","category":"Blog"}},"next":{"fields":{"slug":"/in-san-jose-this-week-for-managers-summit"},"frontmatter":{"title":"In San Jose this week for Managers Summit","category":"Blog"}}}}