{"data":{"markdownRemark":{"html":"<p>I was watching some of the interview with Steve Jobs and Bill Gates interview yesterday from the D5 conference. Bill and Steve got a question if Mac OS X and Windows applications are dinosaurs compared to new browser based applications.</p>\n<p>Steve Jobs made a point that he thought there is room for these applications that are made to run on the desktop, but can use Internet base services. He gave an example of a Google Maps application that runs on the iPhone. He said it works better than any browser based application. They showed vision about the idea that there is room for hybrid rich client applications that use web services.</p>\n<p>At the same time Google has released a browser plugin called 'Gears'. Gears is still in pre-release, but it has a local server, a database and messaging components. This allows developers to write disconnected applications. It is my understanding that some of these components are being included in Adobe Apollo. The database component is based on SQLite, which is the same engine used by Mac OS X for searching. It is an extremely lite weight database engine, and can be accessed with JavaScript.</p>\n<p>[code:c#]</p>\n<p>resultSet = db.execute (</p>\n<p>'INSERT INTO MYTABLE VALUES (?, ?, ?) WHERE id=?',</p>\n<p>[1, 2, 'three four', 5]</p>\n<p>);</p>\n<p>[/code]></p>\n<p>Apollo, Silverlight and Gears all important parts of building these types of applications that use Internet based web services.</p>","frontmatter":{"title":"Bill Gates, Steve Jobs, Rich Client Apps and Google Gears","date":"17.01.2011","category":"Blog"},"timeToRead":1}},"pageContext":{"slug":"/bill-gates-steve-jobs-rich-client-apps-and-google-gears","prev":{"fields":{"slug":"/black-berry-for-x-mas"},"frontmatter":{"title":"BlackBerry for XMas!","category":"Blog"}},"next":{"fields":{"slug":"/beware-of-purchasing-flex-builder-3-from-the-adobe-online-store"},"frontmatter":{"title":"Beware of purchasing Flex Builder 3 from the Adobe Online Store","category":"Blog"}}}}