{"data":{"markdownRemark":{"html":"<p>I have decided to move my web site off of the <a href=\"http://orchardproject.net/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Orchard CMS</a>, and to <a href=\"http://jekyllrb.com\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Jekyll</a>.</p>\n<p><img src=\"/assets/images/jekyll-workers.png\" alt=\"Image of Jekyll Logo\"></p>\n<p>If you are not familiar with <a href=\"http://jekyllrb.com\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Jekyll</a>, it is a static site generator written in Ruby. I initially decided a couple of years ago that I would move my site and blog over to Orchard because it is based on ASP.NET MVC, and I am a C# ASP.NET developer. I also write web based software using <a href=\"http://nodejs.org\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Node.js</a>, and there are a coupld of CMSs based on Node that are pretty good. </p>\n<p>In the process of researching some of the Node based systems, I am came across a number of Node based static site generators. Most of them do essentially the same thing as Jekyll. They use Markdown for posts and pages, which I like.</p>\n<p>I am also a fervent user of <a href=\"https://github.com\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">GitHub</a>. GitHub has a very cool feature called <a href=\"https://pages.github.com\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">GitHub pages</a>. GitHub pages uses Jekyll in combination with their CI to automatically generate static content.</p>\n<p>There are a number of advantages of using static content and GitHub pages. There is no backend database that is required to host the site. GitHub pages as hosted solution will automatically distribute the content over their servers so you get the benefit of having their infrastructure with your site. They have excellent <a href=\"https://help.github.com/categories/github-pages-basics/\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">documentation</a> on hosting your website with GitHub pages.</p>","frontmatter":{"title":"I am moving my website over to Jekyll","date":"12.04.2015","category":"Jekyll"},"timeToRead":1}},"pageContext":{"slug":"/i-am-moving-my-website-over-to-jekyll","prev":{"fields":{"slug":"/dealing-with-a-rejection-from-the-apple-app-store"},"frontmatter":{"title":"Dealing with a rejection from the Apple App Store","category":null}},"next":{"fields":{"slug":"/type-script-presentation-on-february-26-at-the-jax-arc-sig"},"frontmatter":{"title":"TypeScript Presentation on February 26 at the JaxArcSig ","category":"Blog"}}}}