{"data":{"markdownRemark":{"html":"<p>I have been using Microsoft Office InfoPath in some recent projects. One of the nice features of InfoPath is the ability to consume SOAP based web services. This can be used to pre-populate fields in the InfoPath form, or to submit the form to a web service once the user has finished filling out the form.</p>\n<p>I decided to test some different web services with InfoPath, and I received the following error when I tried to use InfoPath with a ColdFusion based web service; [code:c#]</p>\n<p>InfoPath cannot work with this Web service because it uses RPC encoding. Only document literal encoding is supported.</p>\n<p>[/code]></p>\n<p>There is actually a very easy way to fix this if you are using ColdFusion 7 or greater, and that is to use the style attribute in the cfcomponent tag.</p>\n<p>[code:c#]</p>\n<p>...</p>\n<p>[/code]></p>\n<p>There are four different ways a SOAP based web service can be encoded, but the two most popular are rpc encoded and document literal. ColdFusion by default uses rpc encoded and .NET by default uses document literal.</p>\n<p>If you are trying to use an existing rpc encoded web service that is used by other applications, do not change the component style because this will break the existing applications that are consuming this web service. Write a proxy service that that uses document literal to talk to the InfoPath form.</p>","frontmatter":{"title":"Consuming ColdFusion Web Services in Microsoft InfoPath","date":"17.01.2011","category":"Blog"},"timeToRead":1}},"pageContext":{"slug":"/consuming-cold-fusion-web-services-in-microsoft-info-path","prev":{"fields":{"slug":"/convincing-your-boss-to-get-you-a-mac-for-development"},"frontmatter":{"title":"Convincing Your Boss to Get You a Mac for Development","category":"Blog"}},"next":{"fields":{"slug":"/converting-wmf-files-to-gif-files-in-cold-fusion-8-using-the-net-interop"},"frontmatter":{"title":"Converting WMF files to Gif files in ColdFusion 8 using the .NET interop","category":"Blog"}}}}