{"data":{"markdownRemark":{"html":"<p>Kforce in Tampa is looking for a senior ColdFusion architect. If you are interested, please contact Nicole Stephenson – nstephenson@kforce.com. The job description can be found below. <strong>Application Architect Job Summary:</strong></p>\n<p>The software architect leads the definition and implementation of the product software architectures. Product software consisting of user interface software and real time embedded software. In order to further improve the software engineering process a shift to the Unified Process is being made. In this environment we are looking for a software architect whose main tasks are to:</p>\n<ul>\n<li>\n<p>Participate in the complete software development cycle from requirements analysis to deployment of the product</p>\n</li>\n<li>\n<p>Responsible for the software architecture of complex systems and/or services provided to the customer</p>\n</li>\n<li>\n<p>Responsible for further development of the software architecture process</p>\n</li>\n<li>\n<p>Enforce the compliancy with architectural processes for projects </p>\n</li>\n<li>\n<p>Coach teams of software design engineers for planning, tracking and completion of the work within the agreed plan, using agreed methods and processes</p>\n</li>\n<li>\n<p>Advise on and lead the implementation of new methods, tools or processes</p>\n</li>\n</ul>\n<hr>\n<p><strong>Must Have:</strong></p>\n<ul>\n<li>\n<p>Understand software development approaches e.g., object-oriented (OO), component-based</p>\n</li>\n<li>\n<p>Experience with modern, iterative software design processes like the Unified Process</p>\n</li>\n<li>\n<p>Excellent understanding of fundamental technologies;</p>\n</li>\n</ul>\n<p>o operating system/networking</p>\n<p>o middleware</p>\n<p>o security</p>\n<p>o databases</p>\n<p>o graphical user interface (GUI) toolkits</p>\n<ul>\n<li>\n<p>Demonstrated expertise in system modeling and tying architectural solutions to business requirements</p>\n</li>\n<li>\n<p>10 years of IT experience with 3 to 5 years experience in an architectural role</p>\n</li>\n<li>\n<p>Advanced knowledge of Cold fusion, SQL, Java, UML, XML, Search Techniques</p>\n</li>\n</ul>\n<p><strong>Nice to Have:</strong></p>\n<ul>\n<li>\n<p>Has demonstrated leadership skills</p>\n</li>\n<li>\n<p>Good oral and written communication skills</p>\n</li>\n<li>\n<p>Demonstrates strong time management skills</p>\n</li>\n<li>\n<p>Stay current on newest technology and industry trends</p>\n</li>\n<li>\n<p>Is capable to transfer knowledge to various audiences</p>\n</li>\n</ul>\n<p>Education</p>\n<ul>\n<li>Bachelors in Computing Science</li>\n</ul>","frontmatter":{"title":"Kforce in Tampa is Looking for Senior ColdFusion Architect","date":"17.01.2011","category":"Blog"},"timeToRead":2}},"pageContext":{"slug":"/kforce-in-tampa-is-looking-for-senior-cold-fusion-architect","prev":{"fields":{"slug":"/linq-for-sql-presentation-up-on-fekke-com"},"frontmatter":{"title":"LINQ for SQL presentation up on Fekke.com","category":"Blog"}},"next":{"fields":{"slug":"/just-added-a-pod-cast-pod-to-my-blog"},"frontmatter":{"title":"Just added a PodCast Pod to my blog","category":"Blog"}}}}