{"data":{"markdownRemark":{"html":"<p>Sean Corfield has a great post at his <a href=\"http://corfield.org/entry/Overloading_is_not_OO\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">blog</a> in responce to my post about ColdFusion as a true OO language. Yesterday I tried to avoid the arguments for or against ColdFusion as a Object Oriented language. Sean points out some of the differences between C++ and Smalltalk as it pertains to method overloading.</p>\n<p>You can get into a real religous argument about one language over another. I personally consider ColdFusion to be an Object Oriented language since the release of ColdFusion MX. You can do most of the things you can do in other Object Oriented languages i.e. Encapsulation, Persistence, Composition, Inheritance and Polymorphism.</p>\n<p>One of the points I was trying to make is that by learning CFCs, you can springboard into other languages with very little effort. All of the same concepts you learn with CFCs can be applied to languages such as Java, C#, ActionScript, C++ and Smalltalk.</p>\n<p>Alan Kay is credited with coining the term \"Object Oriented\" and for authoring SmallTalk. I read an interview with him recently, and he said that if he had it all to do over again he would not have used the term \"Object Oriented\", he would have used \"Message Oriented\". One of the real powerful features of Object Oriented development is the ability of objects to talk to each other.</p>\n<p>I look forward to reading Sean's posts on double-dispatch.</p>","frontmatter":{"title":"Sean Corfield comments on ColdFusion as an OO language","date":"17.01.2011","category":"Blog"},"timeToRead":1}},"pageContext":{"slug":"/sean-corfield-comments-on-cold-fusion-as-an-oo-language","prev":{"fields":{"slug":"/sean-corfield-presents-duck-typing-at-cfunited"},"frontmatter":{"title":"Sean Corfield presents Duck-Typing at CFUNITED","category":"Blog"}},"next":{"fields":{"slug":"/scott-guthrie-shows-off-iron-ruby"},"frontmatter":{"title":"Scott Guthrie shows off IronRuby","category":"Blog"}}}}